# Случайная непрерывная величина A имеет равномерное
# распределение на промежутке (200, 800].
# Найдите ее среднее значение и дисперсию.

m = (200 + 800) / 2
d = (800 - 200) ** 2 / 12
print(f'среднее значение  : {round(m, 4)}')
print(f'дисперсия  : {round(d, 4)}')
